In [1]:
import pandas as pd
import sqlalchemy as sql
import numpy as np

In [2]:
# Create a temporary sqlite database
data_connection_string = 'sqlite:///'

In [3]:
# Create a database engine w/ "display the SQL code back in the notebook": echo = True.
engine = sql.create_engine(
    data_connection_string
)

engine

Engine(sqlite:///)

# View and create table

In [4]:
# The result is an empty "temporary SQLite database", and this is true since it was just create from code above.
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_18976\3218451222.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

#### Use Pandas DataFrame to create a toble to later store in the SQLite database

In [5]:
stocks_df = pd.DataFrame(

 {
        'HSWF':
            np.random.randint(
                10,
                100,
                10
            )
    
,

        'KLTE':
            np.random.randint(
                100,
                1000,
                10
            )
    
,

        'BJSE':
            np.random.randint(
                10,
                100,
                10
            )
    }
)

stocks_df

   HSWF  KLTE  BJSE
0    80   338    80
1    68   239    10
2    46   205    32
3    24   847    82
4    95   232    47
5    44   499    18
6    62   306    50
7    11   484    13
8    49   385    58
9    92   394    76

# As above, the Pandas dataframe will be used as the table for the SQLite database so that the database can be query for its contents in this exercise.
# It's time to create a table of data in the SQLite.
> `to_sql ( )` w/ parameters: **'dataframe_name\', database_engine**

In [6]:
stocks_df.to_sql(
    'stocks_df',
    engine
)

10

#### Confirm that the table was written into the SQLite database

In [7]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_18976\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks_df']

# Create another instance of SQLite database.

In [8]:
# Create another SQLite instance
data_connection_string = 'sqlite:///mytestSQLite_database.db'

# Create an engine.
engine = sql.create_engine(
    data_connection_string
)

# Confirm database engine exists.
engine

Engine(sqlite:///mytestSQLite_database.db)

In [9]:
stocks_df = pd.DataFrame(
    {
        'UAVN': np.random.randint(10,100,10),
        'OPKS': np.random.randint(10,100,10),
        'WTUY': np.random.randint(10,100,10)
    }
)
stocks_df

   UAVN  OPKS  WTUY
0    26    89    46
1    21    14    22
2    23    18    62
3    52    84    60
4    44    11    14
5    65    74    23
6    84    56    45
7    46    63    11
8    54    24    13
9    84    16    11

In [10]:
stocks_df.to_sql(
    'stocks_df',
    engine
)

10

#### Confirm the table was written in this other SQLite database instance.

In [11]:
# Confirm table.
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_18976\4150302383.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks_df']

# Read a Table into a DataFrame like Pandas
>`pd.read_sql_table ( )` w/ parameters: **"table_name\", con =** connection_engine

In [12]:
sql_stocks_df = pd.read_sql_table(
    'stocks_df',
    con = engine
)

# Now, a new dataframe comes to.
sql_stocks_df

   index  UAVN  OPKS  WTUY
0      0    26    89    46
1      1    21    14    22
2      2    23    18    62
3      3    52    84    60
4      4    44    11    14
5      5    65    74    23
6      6    84    56    45
7      7    46    63    11
8      8    54    24    13
9      9    84    16    11

#### Review the resulting table.
>`Cleanup` data

In [15]:
# Observation: the index was stored in the SQLite since it recieved on instruction to ignore it, and it will ignore any action since the table in question has already existed in the database.
# Solution is to bypass database non-cooperation, write dataframe once more but this time with addional parameters: `dataframe.to_sql ( )`, w/ parameters: `index = False`, & 'if_exists = "replace"'

# Replace the existing table 'stocks_df'
stocks_df.to_sql(
    'stocks_df',
    engine,
    index= False,
    if_exists= 'replace'
)

# Read the table into a DataFrame
sql_stocks_df2 = pd.read_sql_table(
    'stocks_df',
    con= engine
)

# Display dataframe head() & tail()
display(sql_stocks_df2.head())
display(sql_stocks_df2.tail())

   UAVN  OPKS  WTUY
0    26    89    46
1    21    14    22
2    23    18    62
3    52    84    60
4    44    11    14

   UAVN  OPKS  WTUY
5    65    74    23
6    84    56    45
7    46    63    11
8    54    24    13
9    84    16    11

# Skill Drill --> create another instance of SQLite database.

In [16]:
# Create an SQLite database instance.
dat_string = 'sqlite:///'

# Create a database engine.
engine3 = sql.create_engine(
    dat_string
)

# Confirm database engine exits.
engine3

Engine(sqlite:///)

In [17]:
# Make a DataFrame to write tables into the new instance of SQLite database.

thumb_up_stocks = pd.DataFrame(
    {
        'OTEJ': np.random.randint(
            10,
            100,
            10
            )
        ,
        'JDKD': np.random.randint(
            10,
            100,
            10
            )
        ,
        'ETOP': np.random.randint(
            10,
            100,
            10
            )
        ,
        'SEEO': np.random.randint(
            10,
            100,
            10
            )
        ,
        'IEDP': np.random.randint(
            10,
            100,
            10
            )
        ,
        'GJSE': np.random.randint(
            10,
            100,
            10
            )
    }
)

thumb_up_stocks

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
0    18    42    93    56    46    42
1    97    35    99    64    77    82
2    85    71    26    75    56    77
3    61    21    73    43    40    87
4    47    99    29    60    70    65
5    80    22    17    54    31    31
6    40    15    47    19    92    28
7    81    84    16    68    24    67
8    57    31    41    96    92    78
9    53    71    96    20    70    18

In [19]:
# Write DataFrame into SQLite database.
thumb_up_stocks.to_sql(
    'thumb_up_stocks',
    engine3,
    index= False,
    if_exists= 'replace'
)

10

In [20]:
# Read a table from the SQLite database into s DataFrame.
sql_thumb_up_stocks_df = pd.read_sql_table(
    'thumb_up_stocks',
    con= engine3,
)

# Display dataframe head & tail.
display(sql_thumb_up_stocks_df.head())
display(sql_thumb_up_stocks_df.tail())

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
0    18    42    93    56    46    42
1    97    35    99    64    77    82
2    85    71    26    75    56    77
3    61    21    73    43    40    87
4    47    99    29    60    70    65

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
5    80    22    17    54    31    31
6    40    15    47    19    92    28
7    81    84    16    68    24    67
8    57    31    41    96    92    78
9    53    71    96    20    70    18

# This lesson involves Raw SQL